SOAP.postman_collection.json

{
  "info": {
    "_postman_id": "25fa77c0-a2be-429d-b601-a382036b7e6d",
    "name": "SOAP",
    "schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
    "_exporter_id": "44830836",
    "_collection_link": "https://go.postman.co/collection/44830836-25fa77c0-a2be-429d-b601-a382036b7e6d?source=collection_link"
  },
  "item": [
    {
      "name": "ListOfContinentsByName",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml; charset=utf-8"
          },
          {
            "key": "SOAPAction",
            "value": "\"http://www.oorsprong.org/websamples.countryinfo/ListOfContinentsByName\""
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?> <soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"> <soap:Body>\n    <ListOfContinentsByName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n    </ListOfContinentsByName>\n  </soap:Body> </soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "CountryName",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?> <soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"> <soap:Body>\r\n    <CountryName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <sCountryISOCode>RU</sCountryISOCode>\r\n    </CountryName>\r\n  </soap:Body> </soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ],
          "query": [
            {
              "key": "WSDL",
              "value": null
            }
          ]
        }
      },
      "response": []
    },
    {
      "name": "FullCountryInfo",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?> <soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"> <soap:Body>\r\n    <FullCountryInfo xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <sCountryISOCode>RU</sCountryISOCode>\r\n    </FullCountryInfo>\r\n  </soap:Body> </soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ],
          "query": [
            {
              "key": "WSDL",
              "value": null
            }
          ]
        }
      },
      "response": []
    },
    {
      "name": "LanguageName",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml; charset=utf-8"
          },
          {
            "key": "SOAPAction",
            "value": "\"http://www.oorsprong.org/websamples.countryinfo/LanguageName\""
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?> <soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"> <soap:Body>\n    <LanguageName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n      <sISOCode>RU</sISOCode>\n    </LanguageName>\n  </soap:Body> </soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ]
        }
      },
      "response": []
    }
  ]
}